# ExternalDefinitions Properties

---
The ExternalDefinitions type exposes the following members.
| Name| Description
---|---|---
| IsEmpty| Identifies if the definitions collection is empty.(Inherited from Definitions)
| Item| Retrieves a definition by a given name.(Inherited from Definitions)
| Size| The number of definitions in the collection.(Inherited from Definitions)
Top
#### Reference
ExternalDefinitions Class
Autodesk.Revit.DB Namespace